[
  {
    "title": "Tikka Masala",
  
    "content": "For the chicken marinade: Whisk together the yogurt, ginger, salt, chili powder, garam masala, pepper, turmeric and garlic in a large bowl until combined. Toss the chicken in the spiced yogurt marinade until evenly coated. Wrap tightly with plastic wrap and refrigerate at least 3 hours and up to 24. (Overnight works best.)"
  },
  {
    "title": "Chana Masala",
    "content": "Grind onion, tomato, ginger, garlic, and chile pepper together in a food processor into a paste"
  },
  {
    "title": "Aloo Gobi",
    "content": "Traditional Indian dish made of spiced cauliflower and potatoes. This dish is steamed and then fried in oil making it intentionally dry and somewhat crispy. WARNING: This dish is extremely spicy, which is the way I like it. However, if you don't like your food that spicy, feel free to cut down on the serrano pepper and/or cayenne pepper. Also, I would recommend serving this with a side of raita or plain yogurt to cool the mouth down after eating."
  },
  {

    "title":"Pumpkin Bread Muffins",
    "content":"This is a family favorite in our house! You need 3 1/2 cups flour, 3 cups sugar, 2 tsp baking soda, 1 1/2 tsp salt, 2 tsp. cinnamon, 1 tsp. nutmeg, 1 cup vegetable oil, 4 eggs, 2/3 cup water, 2 cups pumpkin, also 2 cups chocolate chips and optional 1 cup chopped walnuts. Preheat oven to 350, mix dry ingredients together, mix pumpkin, water, oil, and eggs in seperate bowl then add to dry mixture and mix well, then add in chocolate chips and optional walnuts. Pour into muffin tins 3/4 full for each, I suggest using cupcake liners, bake each tin for 15-20 minutes, should yeild 36"
  },
  {
  
    "title":"Crispy Peppercorn Chicken Wings",
    "content":"YIELD: Serves 4 INGREDIENTS:2 Tbsp black peppercorns, 1 tablespoon Morton kosher salt,1 Tbsp ground coriander,1 Tbsp ground cumin,1 1/2½tsp garam masala or Chinese five-spice powder, 1/2 teaspoon baking soda,1/2 teaspoon sugar,3 pounds chicken wings, flats and drumettes separated, patted dry with paper towels,2 Tbsp olive oil,2 scallions, 1 lime. PREPARATION: Place peppercorns in the center of a large rimmed baking sheet. Crush peppercorns with bottom of a saucepan, working a few peppercorns at a time and pressing down firmly until you can hear and feel the crunch of peppercorns breaking apart. Transfer to a large bowl. Cover sheet you just used with a double layer of foil; set aside. Add salt, coriander, cumin, garam masala, baking soda, and sugar to bowl with peppercorns and mix with your hands to make sure all spices are intermingled. Add chicken wings and oil and toss with your hands until wings are evenly coated. Arrange wings on prepared sheet, spacing evenly apart. Chill, uncovered, at least 1 hour and up to 1 day. Remove wings from the refigerator and let sit until they've lost the chill of the fridge and are as close t oroom temp as possible, at least 15 minutes. Meanwhile place racks in the top third and center oven and prehaet to 425, You're going to bake and then broil the wings so they get extra crispy. Remove baking sheet from oven and turn on broiler, let heat at least 5 minutes. Broil wings on top rack (or if you have drawer broiler use that) until browned and crisp all over and nubs on ends of drumettes are just a little charred, 3-4 minutes. Remove from oven and turn wings. broil until second side looks crips and lightly charred as the first, about 3 minutes. Let rest about 5 minutes. While the wings are resting, thinly slice sdcallions and cut lime into wedges. Arrange wings on a platter and scatter scallions over. Server with lime wedges alongside.         "
  },
  {
  
    "title":"Dani's easy enchiladas",
    "content":"You will need one 8oz pkg cream cheese, 1 cup onion diced and sauteed, 2 cups shredded cheese cheddar or colby, 1 cup salsa (chunky kind like pace), 1/4 cup sliced black olives, tortillas, and 1 can red enchilada sauce. Mix together everything but 1 cup cheese and olives, spread in warmred tortialls, add 1 can red enchilada sauce top with rest of shredded cheese and olives. Bake at 350 for 15 min."
  },
  {
  
    "title":"Easy Pie Crust",
    "content":"1 1/4 cups flour, 1/2 tsp salt, 1/2 tsp sugar, 1/2 cup (1 stick) butter, 2-4 TBL ice water, use a food processor to blend all dry ingredeints then pulse in butter, then add water and let run until forms a ball. Wrap in plastic wrap and refridgerate for an hour."
  },
  {
  
    "title":"NO-Bake chocolate-Oatmeal cookies",
    "content":"1/2 cup unsweetened cocoa powder, 1 1/2 cups sugar, 1/2 cup butter, 1/2 cup milk, 1/2 cup creamy peanut butter, 1 tsp vanilla, 3 cups rolled or old-fashioned oats (not instant). In medium heavy saucepan over medium heat combine cocoa, sugar, butter and milk. Bring to a rolling boil and cook for 2 minutes, stirring constantly. Remove from the heat and add peanut butter and vanilla, stirring until creamy. Then stir in the oats until well combined. Drop by spoonfuls onto a cookie sheet lined with waxed paper. Let the cookies cool until set. Makes about 40 small or 24 large cookies."
  },
  {
  
    "title":"Cherry Cheese Pie",
    "content":"1 9' graham cracker crust, 1 8oz cream cheese, 1 14oz sweetned condensed milk, 1/3 cup lemon juice 1 tsp vanilla 1 12 oz cherry pie filling, blend cream cheese, milk, lemon jucie and vanilla and pour into crust, cover and refridgerate until ready to serve with chilled filling poured on top."
  },
  {
  
    "title":"Healthy Fettucini Alfredo",
    "content":"1 lb whole wheat fettuccini alfredo ,1 lb chicken tenders(or chicken-soy based substitute),2 heads of broccoli, 2 tblsps butter, pint of fat free half-and-half, 1 cup pecorino romano cheese. First Boil water and add fettuccini. Cook until al dente Season the chicken with salt and pepper, then saute in olive oil, once cooked, drain the oil add butter and half and half. Pour everything over the pasta. Steam the broccli for 4 minutes and add to the micture once the pasta is cooked, add pepper to taste"
  },
  {
  
    "title":"Loaded Baked Potato Dip",
    "content":"2 cups reduced-fat sour cream, 2 cups shredded reduced-fat cheddar cheese, 8 center-cut bacon or turkey bacon strips, chopped and cooked, 1/3 cup minced fresh chives, 2 teaspoons Louisiana-style hot sauce, Hot cooked waffle-cut fries. Directions: In a small bowl, mix the first 5 ingredients until blended; refrigerate until serving. Serve with waffle fries. "
  },
  {
  
    "title":"Bacon Cheeseburger Balls",
    "content":"1 large egg, 1 envelope onion soup mix, 1 pound ground beef, 2 tablespoons all-purpose flour, 2 tablespoons 2% milk, 1 cup shredded cheddar cheese, 4 bacon strips, cooked and crumbled, Coating: 2 large eggs, 1 cup crushed saltines (about 30 crackers), 5 tablespoons canola oil. Directions :In a large bowl, combine egg and soup mix. Crumble beef over mixture and mix well. Divide into 36 portions; set aside. In another large bowl, combine the flour and milk until smooth. Add cheese and bacon; mix well. Shape cheese mixture into 36 balls. Shape one beef portion around each cheese ball. In a shallow bowl, beat eggs for coating. Place cracker crumbs in another bowl. Dip meatballs into eggs, then coat with crumbs. Heat oil in large cast-iron or other heavy skillet over medium heat. Cook meatballs until meat is no longer pink and coating is golden brown, 10-12 minutes "
  }
  
]
